import pandas as pd
from matplotlib import pyplot as plt

d = {'Без индекса': [468, 471, 510, 757, 1642, 10701], 
'С использованием кластеризованного индекса': [420, 421, 425, 414, 472, 498], 
'С использованием некластеризованного индекса': [450, 439, 445, 453, 460, 510]}
df = pd.DataFrame(d, index=[100, 1000, 10000, 50000, 100000, 250000])

df.plot(style=['-o', '-rx', '-gv'], use_index=True)
plt.xlabel('Количество строк в таблице')
plt.ylabel('Время выполнения запроса, мс')
plt.savefig("graph-01.pdf", format="pdf", bbox_inches="tight")

d = {'Без индекса': [495, 644, 715, 2136, 5978, 50571], 
'С использованием кластеризованного индекса': [442, 448, 457, 440, 498, 524], 
'С использованием некластеризованного индекса': [461, 452, 470, 445, 510, 520]}
df = pd.DataFrame(d, index=[100, 1000, 10000, 50000, 100000, 250000])
df.plot(style=['-o', '-rx', '-gv'], use_index=True)
plt.xlabel('Количество строк в таблице')
plt.ylabel('Время выполнения запроса, мс')
plt.savefig("graph-02.pdf", format="pdf", bbox_inches="tight")
